let list = [
    [
        'Oven',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028609/harakteristika-znakiv-zodiaku-1/244.jpg?height=224&width=400',
        'Овен – природжений лідер, і з цим нічого не поробиш. Вже при першому знайомстві з Овном ви буквально шкірою можете відчути головну особливість цього знака Зодіаку – непохитну впевненість в собі і в своїй правоті. Навіть коли Овен мовчить, в кожному його жесті читається внутрішня твердість і непохитність. А вже якщо він заговорить... Повірте, сперечатися з Овном – справа не дуже перспективна.'
    ],
    [
        'Telec',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783029423/harakteristika-znakiv-zodiaku-1/630.jpg?height=224&width=400',
        'Телець на подив наполегливий і сильний, але, як не дивно, дізнатися народженого під цим знаком Зодіаку легше всього за його непомітністю. У компанії Телець буде триматися осторонь і швидше взагалі поспішить покинути це гучне незатишне збіговисько. Тільки в колі близьких друзів, де Тельцю гарантований повний комфорт – і фізичний, і душевний – він може протриматися цілий вечір, але і тоді говірким або емоційним його не назвеш. Однак за його скупими фразами і неквапливими рухами завжди відчувається грунтовність і прихована сила.'
    ],
    [
        'Bliznyky',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028880/harakteristika-znakiv-zodiaku-1/726.jpg?height=224&width=400',
        '«Одна нога тут, інша там» – це вираз ніби спеціально створено для неспокійних Близнюків, які так багато хочуть дізнатися про життя і яким через те так не сидиться на місці. Спілкуючись з народженим під цим знаком Зодіаку, ви можете на деякий час забути про те, що можна і чого не можна, і взагалі, день зараз чи ніч, – Близнюки не сприймають обмежень і умовностей, втім, не чекають подібних безглуздих жертв і від вас'
    ],
    [
        'Rak',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783029094/harakteristika-znakiv-zodiaku-1/823.jpg?height=224&width=400',
        'Рак – найбільш завбачливий з усіх знаків Зодіаку. Найлегше відрізнити Рака від інших, спостерігаючи за тим, як він йде до своєї мети. Справа в тому, що завзятість в його характері поєднується з обережністю, тому Рак не схильний відступати, але і не йде напролом. Його тактика – міркувати, зважувати всі «за» та «проти» і вичікувати, обираючи зручний момент. Зате коли такий момент настане, Рак навряд чи втратить свій шанс.'
    ],
    [
        'Lev',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783029051/harakteristika-znakiv-zodiaku-1/923.jpg?height=224&width=400',
        'Людина, народжена під зодіакальним знаком Лева, чудово вміє себе подати і любить бути в центрі уваги. Найлегше знайти Лева на вечірці або на світському рауті його неважко впізнати по впевненому блиску в очах і неквапливій, навіть ледачій ході.'
    ],
    [
        'Diva',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028956/harakteristika-znakiv-zodiaku-1/435.jpg?height=224&width=400',
        'Народжені під зодіакальним знаком Діви – природжені поціновувачі чистоти. Вперше прийшовши в будинок, де господиня Діва, ви можете здивуватися тому, який порядок панує в цьому помеш '
    ],
    [
        'Terezu',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028463/harakteristika-znakiv-zodiaku-1/1022.jpg?height=224&width=400',
        'Якщо за знаком Зодіаку ваш новий знайомий – Терези, і він справив на вас враження своєю жвавістю, чарівністю та люб'
    ],
    [
        'Scorpion',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028783/harakteristika-znakiv-zodiaku-1/337.jpg?height=224&width=400',
        'Скорпіон – це воїн, до того ж, часто-густо, він кидається в бій, навіть не подумавши попередити про це оточуючих. Народженого під цим знаком Зодіаку ви дізнаєтеся відразу, як тільки поцікаветеся його думкою з якого-небудь питання. Що ж, ви самі цього хотіли: в своїй оцінці Скорпіон буде настільки ж безжалісний, як обєктивний і вбивчо логічний. Навіть якщо аж до цього моменту Скорпіон мило фліртував з вами, ваше невинне запитання тут же перемкне його із сфери емоцій у сферу невблаганної логіки.'
    ],
    [
        'Strilec',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028834/harakteristika-znakiv-zodiaku-1/530.jpg?height=224&width=400',
        'Стрілець – це людина-свято в кращому сенсі цього слова. Цей життєрадісний знак Зодіаку майже завжди перебуває в прекрасному настрої і готовий підняти настрій оточуючим. Завдяки цьому в галасливих компаніях так легко відрізнити Стрільця від інших знаків зодіакального кола: зазвичай Стрілець знаходиться в самій гущавині людей, в самому центрі подій, і сипле жартами без перерви. Він володіє рідкісним талантом заражати всіх навколо своїми яскравими емоціями, у чому йому допомагають його легкість, оптимізм і вроджений дар красномовності.'
    ],
    [
        'Kozerig',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783029137/harakteristika-znakiv-zodiaku-1/1121-670x376.jpg?height=224&width=400',
        'Чи траплялося вам зустрічати людей, які зовні виглядали скромними і поступливими, але коли доходило до справи, несподівано демонстрували свою тверду волю і незламний характер? Швидше за все, це був Козеріг. Саме цей знак Зодіака наділяє людей незвичайною завзятістю в досягненні мети, однак це завзятість не воїна, а дипломата.'
    ],
    [
        'Vodoliy',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028697/harakteristika-znakiv-zodiaku-1/1219.jpg?height=224&width=400',
        'Водолій – справжній художник, він здатний не тільки бачити світ у всьому його дивовижному різноманітті і повноті, але й уважно помічати при цьому найдрібніші деталі. Завдяки таким якостям, дізнатися народженого під цим знаком Зодіаку нескладно: фліртуючи з вами на вечірці, Водолій буде щиро захоплюватися вашою красою, роблячи вам самі захоплені компліменти. Але він же в перервах між компліментами не забуде повідомити і про те, що колір помади вам не підходить, а фасон сукні непогано б змінити. Такі всі Водолії, які вміють поєднувати дитячу безпосередність і цілісне сприйняття світу з холодним аналітичним розумом.'
    ],
    [
        'Rubu',
        'https://sites.google.com/site/tvijgoroskop/_/rsrc/1472783028561/harakteristika-znakiv-zodiaku-1/190.jpg?height=224&width=400',
        'Мабуть, у всьому Зодіакальному колі немає знака загадковішого від Риб. Глибини в яких вони плавають, воістину бездонні, і залишають мало шансів простим смертним в них заглянути. Їх особа може бути безтурботно спокійною, а поведінка демонструвати мрійливість, байдужість і навіть деяку лінь. Навіть при всьому бажанні оточуючим навряд чи вдасться вивести Риб з себе: ні релігія, ні звинувачення, ні бурхливі сцени не здатні по-справжньому позбавити їх глибокої внутрішньої гармонії Навіть саме життя з його вічними проблемами і суєтою не в змозі змусити Риб подолати їх блаженну рівновагу і, засукавши рукави, рішуче взятися за справу. Навпаки, найчастіше вони воліють покладатися на Долю і, незважаючи на'
    ]
]
day = +prompt('Введіть день: ')
month = +prompt('Введіть місяць: ')
switch(true){
    case (day >= 21 && month == 3) || (day <= 20 && month == 4):
        index = 0
    break
    case  (day >= 21 && month == 4) || (day <= 21 && month == 5):
        index = 1
    break
    case  (day >= 22 && month == 5) || (day <= 22 && month == 6):
        index = 2
    break
    case  (day >= 23 && month == 6) || (day <= 23 && month == 7):
        index = 3
    break
    case  (day >= 24 && month == 7) || (day <= 23 && month == 8):
        index = 4
    break
    case  (day >= 24 && month == 8) || (day <= 23 && month == 9):
        index = 5
    break
    case  (day >= 24 && month == 9) || (day <= 23 && month == 10):
        index = 6
    break
    case  (day >= 24 && month == 10) || (day <= 22 && month == 11):
        index = 7
    break
    case  (day >= 23 && month == 11) || (day <= 21 && month == 12):
        index = 8
    break
    case  (day >= 22 && month == 12) || (day <= 20 && month == 1):
        index = 9
    break
    case  (day >= 21 && month == 1) || (day <= 19 && month == 2):
        index = 10
    break
    case  (day >= 20 && month == 2) || (day <= 20 && month == 3):
        index = 11
    break
}
let title = document.getElementById('title'),
    desc = document.getElementById('desc')
    title.textContent = list[index][0]
    desc.textContent = list[index][2]
    image.src = list[index][1]
